
[Oil_Refinery]
ID_CLARK=The terrorists are demanding the end of deportation proceedings against a senior citizen named Peja Sicic. It turns out that Mr. Sicic was a high-ranking official in the Yugoslavian Ustache regime during World War II, working for the bad guys. That piece of his past just caught up with him. However, members of a neo-fascist organization called the People's Social Nationalist Party (PSNP) don't see anything wrong in what he did back in the forties. They've seized the refinery in response to the deportation hearings, and if Sicic isn't released within twenty-four hours they threaten to blow the entire facility sky-high. \n\nAll the information we have on the terrorists indicates that they're neither well-organized nor well-armed. Intel's analysis is that their bombs are most likely home-made, which means that there's a chance that they could go off at any moment and take the surrounding landscape with them.
ID_CODENAME=Stolen Flame
ID_CONTROL=Operation Stolen Flame. Terrorists have seized control of an oil refinery in Amuay, Venezuela. They claim to have rigged the entire complex with explosives and are threatening to detonate them unless their demands are met. Your mission is to neutralize the terrorists.
ID_DATETIME=2005.11.30 - 2300
ID_LOCATION=Amuay, Venezuela
ID_MENUNAME=Oil Refinery
ID_MISSION_ORDER=Your mission is to neutralize the terrorists and prevent them from arming their bombs. Expect heavy resistance at the back entrance, main control room and main machine room. Keep your eyes open for shooters on catwalks and overlooking open areas. Intelligence reports approximately 25 tangos on the premises.
ID_SWEENY=What we are dealing with here is a lot of bloody dangerous amateurs sitting on top of a powder keg. These lads are affiliated with the so-called People's Social Nationalist Party, which got itself booted from the far right coalition for being too extremist. Neat trick, that. They've had a number of scraps with the police, usually after seven or eight of them get together to introduce an immigrant to the finer points of a mass beating. \n\nNothing in their profile indicates that they're well-organized or well-supported, so you can most likely expect a lot of small caliber arms. They're erratic, politically fanatical and by all accounts, not that bright. Right now, they're sticking explosives all over a few million barrels of crude oil and gasoline, and they don't seem to care if they get incinerated, so long as they get their point across.
[Alpines]
ID_CLARK=Normally we'd leave something like this to the Swiss authorities, but the profile of the hostages is high enough that we've been called in. There were at least five IMF conference delegates present in the village when it was stormed. I say "were" because we don't know how many are left alive. The terrorists hit the local bank first, then rounded up hostages when they realized they were pinned down. They've issued a few demands, but they haven't identified themselves. \n\nSomething about all this stinks, but figuring out what is Intel's job, not yours. Yours is to go in there, clear out that village and make sure both the delegates and the locals who've been taken hostage come out in one piece.
ID_CODENAME=Cold Dagger
ID_CONTROL=Operation Cold Dagger. Terrorists have taken hostages in the village of Lamoura, Switzerland. Among them are several delegates to the current IMF conference in Geneva. Swiss security forces have sealed off the area in preparation for your arrival. Your mission is to liberate the IMF delegates.
ID_DATETIME=2005.02.12 - 1600
ID_LOCATION=Jura Canton, Switzerland
ID_MENUNAME=Alpine Village
ID_MISSION_ORDER=Your mission is to liberate the IMF delegates. The hostages are being held in two separate places marked on your map and are under heavy guard. The terrorists have been alerted to police presence and snipers are probably already waiting for you, so watch out for open areas.
ID_NEWSWIRE=A potential environmental catastrophe was prevented this morning in Amuay, Venezuela, when elite troops ended a nine-hour stand-off with terrorists at an oil refinery. The soldiers stormed the refinery site just after dark, killing or capturing all of the terrorists. Army spokesman Diego Abreu noted in his remarks to the press that the operation was considered a tremendous success, despite the damage done to the refinery complex when one of the terrorists' bombs inadvertently went off during the shooting.\n\nThe terrorists had seized the refinery earlier in the day, overpowering security personnel and forcibly evacuating the site's workers. In subsequent conversations with police, they informed authorities that they had set up explosives around the complex that they would not hesitate to trigger if their demands were not met. Those demands included the release of a man named Peja Sicic, an elderly resident of Caracas against whom the Venezuelan government has recently begun deportation hea
ID_NEWSWIRE1=rings. Sicic stands accused of war crimes dating back to his suspected involvement in the Yugoslavian Ustache regime during the Second World War. Sicic's lawyers had no comment on the events in Amuay.
ID_SWEENY=There's something odd about this operation. At first, the terrorists seemed unaware of the identity of their captives, as though they'd been planning to hit the town anyway and the presence of the IMF officials was a lucky accident. Apparently the delegates were taking a day's ski trip away from the conference in Geneva. They'd have been better off if they'd kept their minds on business. Still, there's something here that doesn't make any sense. There's certainly nothing else in Lamoura worth mounting an operation like this over.
[Mountain_High]
ID_CLARK=It looks like the Swiss didn't bottle up these terrorists in Lamoura as well as they claimed. A handful managed to sneak out with hostages, while the local authorities were still sealing the perimeter. Near as we can tell, they had vehicles waiting downslope for their getaway. Those who slipped out headed for the French border, but got mixed up in the storm and took the wrong turn on highway N90.\n\nThat's the good news. The bad is that they wiped out about fifty clicks from Lamoura. The ones who can still walk have fallen back into a tunnel, taking their hostages with them. They're using the wrecked cars as a barricade and firing at Swiss police as we speak. The other end of the tunnel is blocked off, so we're going to have to go in the front door.
ID_CODENAME=Mountain Watch
ID_CONTROL=Operation Mountain Watch. Several terrorists managed to escape Lamoura with hostages before your arrival. At the mouth of a tunnel on the N90 highway, the lead car skidded into the tunnel wall, producing a multiple car pile-up. The surviving terrorists have retreated into the tunnel with their hostages, using the wrecked cars for cover. Your mission is to the rescue the remaining IMF delegates.
ID_DATETIME=2005.02.12 - 1900
ID_LOCATION=Jura Canton, Switzerland
ID_MENUNAME=Mountain Highway
ID_MISSION_ORDER=Your mission is to rescue the remaining IMF delegates. The hostages are being held in the older section of the access tunnels and are under heavy guard. You can access this section of tunnels by using the manhole located a little further up the mountain, by using the maintenance stairway, or simply going straight down the highway. Be advised that the tangos are expecting you, so stay alert.
ID_NEWSWIRE=A tense stand-off at an exclusive ski resort in Switzerland ended this evening. Swiss police moved into the village of Lamoura, where terrorists were holding hostage several delegates to the IMF meeting currently going on in Geneva. After a fierce firefight, they were able to subdue the hostage-takers. Police in Lamoura will neither confirm nor deny reports that several of the hostages are still missing. "We are confident this operation has been brought to a successful close, though we regret the loss of life incurred," said police spokesman Henri Schulz. "It is extremely regrettable that these events occurred."\n\nThe delegates were in Lamoura for a day's skiing holiday while taking a break from the IMF summit, an event which has been marked by some massive, but thus-far non-violent protests. IMF spokesman Oliver Clayton called the incident "extremely embarrassing" and promised beefed-up security for the remainder of the conference.
ID_SWEENY=Bad luck on this one. The tunnel the terrorists have holed up in isn't just a cheese bore through a pile of rock. Instead, the whole thing's connected to an old bunker system that someone carved out back in the 1930s. It's a rat maze, and these rats have sharp teeth. \n\nWe have confirmation from several of the rescued hostages that our terrorists went for the bank first, and that once inside they looked for old bank records before they went rummaging for cash. Hopefully, you'll be able to bring someone in who can shed light on this mess, because right now both Intel and I are stumped.
[Shipyard]
ID_CLARK=Remember the refinery operation in Amuay? Imagine that scenario, only this time you're going up against pros. That's basically what we're dealing with here, ladies and gentlemen, but we actually caught a break on this one. It seems that one of the charges the terrorists were setting on the ship hulls detonated prematurely. It wrecked the hull, but alerted local police forces, and they were smart enough to call in the heavy artillery. Once the Norwegian anti-terrorist units arrived on the scene, our playmates fell back to the main ship finishing facility and started issuing their demands. \n\nThere's a lot of long sight lines in the shipyard, and a lot of good sniping points. Advance slowly and carefully or you're going to find yourself chewed up and spit out a hundred yards from your objectives.
ID_CODENAME=Sentinel Wolf
ID_CONTROL=Operation Sentinel Wolf. Terrorists have seized a shipyard in Bergen, Norway. When authorities were alerted by a premature bomb detonation, the terrorists fell back to the central ship completion area. They have rigged much of the shipyard with explosives. Your mission is to prevent the detonation of further explosives and eliminate all terrorists.
ID_DATETIME=2006.02.05 - 0300
ID_LOCATION=Bergen, Norway
ID_MENUNAME=Shipyard
ID_MISSION_ORDER=Your mission is to prevent the detonation of further explosives and eliminate all terrorists. The bombs are strategically placed to blow up the ship hull and most of the facility. To prevent their detonation you can either disarm all three bombs or neutralize the terrorist leader. He should be under the ship's hull overseeing the final bomb placement. Getting there, however, will not be easy as he will surely detonate the bombs as soon as he sees you coming.
ID_NEWSWIRE=After a bitter firefight, Swiss police have apprehended the last of the terrorists involved in this morning's shoot-out in the skiing village of Lamoura. The terrorists were apparently attempting to flee the country with several hostages when, according to witnesses, their lead vehicle skidded on some ice and struck the wall of a mountain tunnel. In the resulting pile-up, two of the terrorists were killed and another wounded, while the rest escaped on foot into the tunnel with their remaining hostages. Authorities then rushed to the scene, and either took into custody or killed all of the terrorists. Most of the hostage-takers elected to fight rather than surrender, and police believe that more than a half-dozen were killed in the affair. An exact count is still pending, as medical personnel work to remove bodies from the tunnel in the wake of the shooting.\n\n"We are especially proud and pleased that none of the hostages were injured," said police spokesperson Ariel Zweidler, "and for t
ID_NEWSWIRE1=hat we have the fast action and superb training of our police forces to thank."
ID_SWEENY=Here's the latest we know on your Swiss adventure, and it isn't much. All that we've got from the bodies is that they were traveling on Argentinean passports. We did manage to bring in one chap who got himself trapped in an overturned car, but he hasn't said anything useful yet. I expect that will change with time. In any case, the Argentine government is promising a full investigation and will grant us access to their findings.\n\nToday you've got oil tankers to deal with. The Bergen shipyard's in the middle of a contract with PDVSA, the Venezuelan national oil company. They're making a fleet of new tankers, and those are the hulls the terrorists are targeting. The ships are insured, but that's not the point; if those hulls are wrecked, it's going to cost PDVSA millions from the delays. \n\nThe terrorists' demands are very interesting. They want the release of some paramilitary types convicted of blowing up oil company offices, the American oil facilities in Venezuela nationalized a
ID_SWEENY1=nd the usual safe passage and money. Someone's got serious issues with the Venezuelan oil industry, it would seem.
[Airport]
ID_CLARK=Pack your swim trunks, you're going to the Cayman Islands. Unfortunately, it's not a pleasure cruise. A joint drug intercept between the American DEA and British Customs went haywire at a private airport and since the defense of the Caymans is still under British control, we've been put on the spot.\n\nThe local police were smart enough to block off the runways so the terrorists can't take off. What that means in practical terms is that we have a squad of angry, heavily armed drug dealers somewhere in the airport complex itself. Even worse, they've got ticketing agents with them as hostages.\n\nAccording to witnesses, someone or something must have tipped the smugglers off, because they were toting more ordnance than usual. When the DEA and Customs agents went to make their move, they got a nasty surprise.
ID_CODENAME=Falcon Hour
ID_CONTROL=Operation Falcon Hour. A joint American-British drug bust in Cayman Brac has failed, leaving several agents down and others taken hostage. The kidnappers have taken refuge within a private airport complex and are threatening to execute their hostages. Your mission is to rescue the captives and eliminate their captors.
ID_DATETIME=2006.03.10 - 1300
ID_LOCATION=Cayman Brac
ID_MENUNAME=Private Airport
ID_MISSION_ORDER=Your mission is to rescue the captives and eliminate their captors. The hostages have been separated. For a better chance of success, synchronize your attacks on rooms where hostages are being held. Recon has spotted a lone sniper outside, on the second floor of the terminal building. Since he is right beside the room containing a hostage, there's good chance a hostage will be executed if the sniper sees you.
ID_NEWSWIRE=Norwegian security forces brought an end to a crisis at the country's largest shipbuilding facility just outside of Bergen. Police responded to an alarm raised by members of the shipyard's security staff, and found a squad of saboteurs on site. The men, who have not been identified, were apparently planting explosive devices on unfinished ship hulls.\n\nAfter an exchange of gunfire with police, the intruders were rousted by the arrival of elite anti-terrorist troops from the Norwegian armed forces. Shipyard spokesman Ragnar Arnesson expressed his gratitude to the special forces unit who liberated both the facility and several employees trapped inside, and noted that there should be no delays in the construction of any vessels as a result of the incident. No group has yet claimed responsibility for the incident, though once trapped the terrorists did make several demands. "We do not negotiate with terrorists," noted government spokeswoman Marit Sternhoff tersely.
ID_SWEENY=Cayman Brac's the easternmost of the Cayman Islands. It's got a lot of money, a lot of big houses and a lot of people who like their privacy. The airport where the hostage-takers are holed up is small and private, with a short strip. Mostly it handles Gulfstreams and the like, wealthy people jetting in for the weekend. It's also a major drug distribution hub, mainly marijuana and cocaine, and the local police have made several busts there in the past. However, there's never been a hostage situation before. Don't kidnap the police was always one of the unwritten rules, but it seems that rule's been changed.
[Island]
ID_CLARK=It looks like hostage-taking is the latest fad on Cayman Brac. What we're looking at is the island estate of a man named Nikola Gospic, whom the local police wanted to ask some questions about the run-in at the airport. It was routine stuff, just "Did you see anything?", but they got a non-routine response. Gospic wasn't at home, but somebody else was. When they saw the police they panicked and opened fire. The officers who weren't hit in the first exchange fell back and radioed in for back-up, but two men are already down and a couple more were taken hostage by whoever's in the house.\n\nSince we were still in the vicinity, the Governor specifically requested that we help resolve this situation. Fortunately, Gospic likes his privacy, because the estate is walled and out in the middle of nowhere.
ID_CODENAME=Pearl Castle
ID_CONTROL=Operation Pearl Castle. Narco-terrorists have taken members of the Royal Cayman Islands Police Force hostage at a private estate on Cayman Brac. The Governor's Office requests your assistance in resolving the situation. Your mission is to secure the estate and liberate the captive officers.
ID_DATETIME=2006.04.19 - 1300
ID_LOCATION=Cayman Brac
ID_MENUNAME=Island Estate
ID_MISSION_ORDER=Your mission is to secure the estate and liberate the captive officers. The hostages are located on opposite sides on the mansion. One of the police officers is in the master bathroom, while the other is in the guesthouse. Getting these hostages out shouldn't be a problem, but getting to them will be tricky.
ID_NEWSWIRE=A day-long stand-off between narco-terrorists and police came to a dramatic conclusion on Cayman Brac, the easternmost of the three Cayman Islands. According to local reports, members of the British SAS successfully stormed the island's airfield and liberated all hostages. Among the captives were several local customs officials, taken prisoner after a shoot-out with suspected drug smugglers. "We are extremely grateful to the men and women of the SAS who risked their lives today to rescue our citizens," said airport chief of operations Joseph McFayden. "This entire situation was a terrible shock to us." McFayden also promised increased security at the airport, and expressed a hope that "nothing like this would ever happen again."
ID_SWEENY=The estate you'll be liberating belongs to a man named Nikola Gospic, one of the most well-liked men on Cayman Brac. Gospic is in his 80s and is something of a philanthropist. He's also got extensive business interests throughout Argentina and Brazil, and according to Intel he's currently in Buenos Aires tending to some of them. He picked a smart time to be out of the house.\n\nWe can safely assume that the men holed up on Gospic's estate are tied to the narco-terrorists you took down at the airstrip. The bullets the local ballistics experts dug out of one of their police cars match the ones the airport terrorists were using. Furthermore, the Cayman authorities have a positive ID on two of the shooters at the house. They're small-time drug runners who'd been overheard bragging about a big score they were about to make.
[MeatPacking]
ID_CLARK=According to police reports, a night watchman interrupted some intruders in the act of destroying company records at the plant. He was killed, but not before he managed to call the police. When the cops arrived, however, they found that the burglars had taken hostages, including a few night-shift managers. They also found that they were taking AK-47 fire whenever they got close to the building, so they pulled back and waited for the terrorists' next move. \n\nNow here's where it gets really interesting. Those managers call some of the most powerful politicians in Argentina "Mommy" and "Daddy," and they all seem to have gotten their jobs as political favors to their parents. Who gave them those jobs? Why, Mr. Gospic from Cayman Brac did. He just happens to have a small ownership share in the meat-packing operation.\n\nThat, incidentally, is why a request was made for "the men in black." We can figure out the puzzle behind this later, though. Right now we've got at least two dead hostage
ID_CLARK1=s and a threat to kill another one on the hour if we don't meet their demands. Get to work.
ID_CODENAME=Crimson Hook
ID_CONTROL=Operation Crimson Hook. A hostage situation has developed at a meat packing facility in Pilar, Argentina. In response to a request from the Argentine government, RAINBOW is being deployed to resolve the situation. Your mission is to secure the hostages and eliminate their captors.
ID_DATETIME=2006.05.17 - 0500
ID_LOCATION=Pilar, Argentina
ID_MENUNAME=Meat Packing Plant
ID_MISSION_ORDER=Your mission is to secure the hostages and eliminate their captors. Terrorists are scattered throughout the plant, but you should encounter especially heavy resistance in the cafeteria and the upstairs control room near the hostages. There are two ways to enter the plant and I advise you to send a team each way so there won't be any surprises later.
ID_NEWSWIRE=Police resolved a second hostage crisis today on the island of Cayman Brac, at the estate of a local philanthropist. The crisis, which began earlier in the day when gunmen in the house opened fire on police, was brought to a successful conclusion when police rushed the house, subduing the men inside. The gunmen, allegedly members of a drug smuggling ring, may be connected to the narco-terrorists responsible for the incident at the island's airport yesterday afternoon. According to sources in the Cayman Islands, the owner of the estate is currently out of the country. A statement released by his lawyer expresses deep regret at the incident and indicates that the gunmen in the house were there without his knowledge or permission.
ID_SWEENY=We're starting to find some links here. The story we're being told on the estate incident is that a member of the household staff took advantage of Gospic's absence. He'd run up debts with some local smugglers, and to pay them off he offered the house as a base of operations. It's a good story, but it's difficult to verify. It seems that the employee in question, a gardener named Michael Curry, was found conveniently dead afterwards. Very neat; one bullet to the back of the head. Not at all what you'd expect in a firefight.\n\nIn any case, it turns out that Mr. Gospic owns a minority share in the meat-packing operation you're going to be liberating. He also has his fingers in a dozen other industries, ranging from shipping to oil exploration in Venezuela, and one of his companies made a massive contribution to the campaign fund of a far right-wing presidential candidate named Alvaro Gutierrez. Gutierrez is quite a character himself. He's got support from a half-dozen neo-fascist orga
ID_SWEENY1=nizations, but he's been good at maintaining a politically appropriate distance. Intel has, however, managed to link him to the terrorists from Switzerland. It seems he helped a few of them get their passports.\n\nThe final piece of the puzzle we've got in hand comes from the terrorists in the meat packing plant. Several of their demands reiterate those made by the shipyard terrorists in Bergen. There's something here we're not seeing.
[Import_Export]
ID_CLARK=Since RAINBOW keeps on getting tapped for missions in the Western Hemisphere, a suggestion's been made to keep you stationed out at Langley temporarily, at least until things calm down. In the meantime, we've got a new assignment.\n\nA U.S. Coast Guard cutter intercepted a freighter bound for Savannah. On board were a few hundred kilos of cocaine, approximately twenty crates of assault weapons, and a few million sheets of neo-fascist propaganda. The ship's manifest pointed the Coast Guard to a shipping firm in Porto Alegre, Brazil. Coincidentally, that's the same company some of the prisoners from Cayman Brac mentioned in their plea-bargains.\n\nWith that information in hand, the Brazilian government began surveillance of the operation. They hit the jackpot. We've got footage of guns and drugs going in and out of the warehouse. The surprise here, though, is that we've also got video of what looks like chemical weapons containers labeled in Russian.\n\nTechnically, this sort of opera
ID_CLARK1=tion isn't under our jurisdiction, but I twisted a few arms and got the assignment. This looks too much like a part of what we're already dealing with for me to let it go.
ID_CODENAME=Stone Cannon
ID_CONTROL=Operation Stone Cannon. An import-export firm in Porto Alegre, Brazil, is allegedly housing what authorities have identified as components of a chemical nerve agent. Surveillance data has been confirmed by details of confessions extracted from several of the terrorists captured on Cayman Brac. Your mission is to raid the company's warehouse and secure all chemical agents on the premises.
ID_DATETIME=2006.06.10 - 0500
ID_LOCATION=Porto Alegre, Brazil
ID_MENUNAME=Import-Export
ID_MISSION_ORDER=Your mission is to raid the company's warehouse and secure all chemical agents on the premises. Since this is a raid, no one is expecting you. Use this to your advantage, but don't let your guard down even for an instant. These guys are well armed and highly motivated.
ID_NEWSWIRE=An impromptu hostage crisis in the recession-wracked Argentina has been brought to a successful, if tragic, conclusion. Argentine special forces were able to successfully storm a meat packing plant in the city of Pilar, where members of the plant staff had been taken hostage by armed burglars. Police responded to an emergency call from the plant's night watchman, who had apparently surprised the men in the company offices.\n\nTwo hostages were killed by the burglars before the special anti-terrorist unit arrived on the scene. No group claimed responsibility for the attack, but the demands the hostage-takers issued called for the release of known terrorists currently being held in several countries, including Venezuela. Police are still looking for a motive to the attack, and an investigation is ongoing. A memorial service for the victims will be held Tuesday at Saint Mary's Catholic Church in Pilar.
ID_SWEENY=You did nice work in Argentina, and now Intel's hoping to return the favor. At this point we can confidently state that the "burglars" at the meat-packaging plant were there to destroy forty years worth of financial records. You'd think a match would have done the job, but they seemed intent on keeping the plant intact. \n\nThe good news is, they didn't nick the back-ups. We found those and we're beginning to see why someone wanted the lot destroyed. It's going to take weeks, if not longer, to decipher them, but one thing is clear: that packing plant was used as a cover for a great many things.\n\nAs for the import-export firm, the surveillance footage we’ve got shows them moving a lot of gear in and out, including what looks to be top-of-the-line weaponry. Be prepared; they’re not going to be firing cheap AK-47 knock-offs when you come through the door. We’re still working on getting a final translation on the labels on the shipping containers, but a first look confirms our worst fears
ID_SWEENY1=. It’s the ingredients for VX nerve gas. \n\nVX, in case you were wondering, is a nerve agent that binds to neurotransmitters and blocks them. It doesn’t matter if you touch it or inhale it; the end result is a quick, agonizing death, and the amount required for a lethal dose is tiny. Even worse, the stuff sticks around forever and adheres to damn near any surface you can imagine.
[Penthouse]
ID_CLARK=Ladies and gentlemen, it is time to start closing the net on an Argentine politician named Alvaro Gutierrez.\n\nWe've got circumstantial evidence that Gutierrez is linked to Gospic. I want to get something concrete and find out what those two are up to. So far, all we've got is that it's big, it's dangerous, and we can't see it all.\n\nThat's why you're going to bug Gutierrez's penthouse. I want to know who he's talking to, what he's saying and when he's saying it. Hell, I even want to know if he snores. He's cagey, though, so while you're upstairs, the local cops are going to be downstairs tearing his offices apart. It doesn't really matter if they find anything. They'll keep Gutierrez busy enough that you should have a relatively clear run through the penthouse.
ID_CODENAME=Shattered Glass
ID_CONTROL=Operation Shattered Glass. RAINBOW has been authorized to plant audio surveillance devices in the penthouse of Alvaro Gutierrez, an extremist Argentine politician. Gutierrez has been linked to both the incidents in Switzerland and Nikola Gospic, the owner of the Cayman estate and the meat packing firm. Your mission is to plant bugs in the computer and one of two phones in Gutierrez' apartment.
ID_DATETIME=2006.08.09 - 0900
ID_LOCATION=Buenos Aires, Argentina
ID_MENUNAME=Penthouse
ID_MISSION_ORDER=Your mission is to plant bugs in the computer and one of two phones in Gutierrez's apartment. Since this is a reconnaissance mission, use of deadly force is NOT sanctioned. If Gutierrez's guards find you in the apartment, the mission is over. Some of the guards are busy watching the raid downstairs, while others seem to be watching a football game. However, a few dedicated souls are at their posts and may pose a problem.
ID_NEWSWIRE=SWAT teams mounted what police spokesmen in Brazil called the biggest bust of an international weapons ring in the past decade. The streets of Porto Alegre, Brazil echoed with gunfire shortly after sunrise, as police raided an import-export firm with suspected connections to narcotics and weapons smuggling. SWAT officers entered the facility, a warehouse in the commerce district, just after sunrise. After a fierce gun battle, they emerged with several men in custody. While reporters were not allowed into the warehouse following the raid because of continuing security concerns, they did witness crates of what looked to be machine guns and assault rifles being removed from the site under heavy guard. There is no word yet on the identity of any of the men killed or taken into custody.
ID_SWEENY=Our people sat down with Mr. Gospic for a little chat and he seems nice enough. He arrived in the Caymans back in the 1940s, already wealthy, and claims to have been lucky in business ever since. I think we got ten apologies for the incident at his estate, which he called "a terrible accident," and he's promised to hire more security so that it never happens again. Right now we've got nothing on him, except that some of his companies are mixed up in a very bad business. Indeed, he seemed extremely upset over that whole records mess in Pilar. Nothing links him directly to trouble, though.\n\nGutierrez is a different story. For one thing, the terrorist who survived the Swiss highway firefight gave us his name during questioning. For another, several of his bodyguards were former People's Social Nationalist thugs, at least before he put them in tuxedos to watch his back. Make no mistake, though. They're still thugs. If Gutierrez wins that election, things could get very ugly indeed.
[Bank]
ID_CLARK=Both the British and Swiss governments are asking for our help on this one. Apparently there are Swiss nationals inside the bank carrying "sensitive financial documents", but they're not willing to say more at the moment. Obviously, the Swiss government is very concerned about what happens to both their people and their papers.\n\nThe bank's four centuries old and private, which means that it's built like a fortress. We're looking at thick walls, thick doors, and good sight lines. There are two routes down to the vault, which is where we suspect the hostages are being held. Be careful of snipers on the walkway on the upper level. It's where I'd put my men, if I were trying to hold this thing. \n\nThe other thing to watch for is the bank's security system. It looks like the terrorists got it back on line. One of their people is monitoring their camera set-up from the security room on the first floor, to the right of the front doors. You should probably take him out from outside the building.
ID_CODENAME=Lion Shadow
ID_CONTROL=Operation Lion Shadow. A private banking house in London has been seized by terrorists in paramilitary gear. They have taken hostages and opened fire on the Metropolitan Police. As several of the hostages are Swiss nationals, both the British and Swiss governments have requested your assistance in this matter. Your mission is to liberate the bank and any hostages within, and prevent the destruction of valuable financial records that we believe are the terrorists' target.
ID_DATETIME=2006.09.23 - 1500
ID_LOCATION=London, England
ID_MENUNAME=Banking House
ID_MISSION_ORDER=Your mission is to liberate the bank and any hostages within, and prevent the destruction of valuable financial records that we believe are the terrorists' target. Reports from the local police describe these guys as very well armed and simply waiting for someone to intervene. Before entering the building, you should neutralize the security camera operator located on the first floor to the right of the main entrance. Once inside, your first objective is to prevent the destruction of financial records in the file storage library situated on the second floor. According to the blueprints, there are two ways of getting down to the underground vault where the hostages are: a stairway behind the teller's booth and a back stairway in the director's office.
ID_NEWSWIRE=Last night police raided the political offices of presidential candidate Alvaro Gutierrez. After an extensive search, police came up empty-handed. Police spokesman Eric Sanchez said, "We are very surprised with the outcome of this raid as our information came from an extremely reliable source. We apologize for any inconvenience we may have caused candidate Gutierrez."\n\nAn official statement from the Gutierrez campaign read, "We have no idea why the police decided to search our offices, but we cooperated with all of their demands. We are very happy that this unpleasant situation is behind us and look forward to getting back to making Alvaro Gutierrez the next President of Argentina."
ID_SWEENY=We have a positive ID on the man in charge of the London bank operation. His name is Douglas Preston. He's a British army vet, decorated for service in Kuwait. He's also a major embarrassment to the British government. It seems once their war hero got home, he declared his sympathies for an organization called the Unified People's Front, which is an umbrella for every neo-fascist group in the UK. Officially, he split from the UPF six years ago. Unofficially, his politics haven't changed, and he's been connected to some illicit arms sales to paramilitary groups in Colombia. In short, he sounds like just the sort of man Gutierrez would have over for a drink.\n\nPreston's dossier says that he's good at what he does, which means that this operation's going to be no cakewalk. His psych profile indicates that he has no problem using hostages as human shields, and his men are likely to be highly trained and well-armed. He's a bit of a perfectionist, very cautious, so don't wait for his sq
ID_SWEENY1=uad to make mistakes. They won't.
[MeatPacking_Day]
ID_CLARK=Intel's convinced that Gospic has gotten his hands on multiple chemical weapons. If he was behind the British bank operation, then it makes sense that Preston was his supplier. Preston made a lot of contacts in Kuwait, including a few with access to the old Soviet chemical weapons labs. \n\nIt seems highly probable at this point that Gospic has his hands on some amount of VX nerve agent. VX is extremely lethal and very durable, and can be absorbed through skin contact. That's why he had his fingers in the meat-packing plant. The plant ships beef all over the world, including Europe and Israel. We're talking mass murder across a dozen countries.\n\nNow, we could probably interdict any shipments from the plant, after the fact, but that's too risky. I want us to take that nerve agent into custody before a single drop gets used. That's why we're going back in to the meat-packing plant. The Argentine government confirmed sightings of some of Gospic's men in and around Pilar, which means tha
ID_CLARK1=t there's no time to waste. Saddle up. You're going hunting for nerve gas.
ID_CODENAME=Broken Stone
ID_CONTROL=Operation Broken Stone. We have concluded that the meat-packing operation in Pilar is being used as a distribution vector for chemical agents. The Argentine government confirms that several of Gospic's operatives have recently entered the country and have been spotted in Pilar. Your mission is to secure the meat-packing facility and prevent the dispersal of the chemical agent.
ID_DATETIME=2006.11.11 - 1100
ID_LOCATION=Pilar, Argentina
ID_MENUNAME=Meat Packing Plant 2
ID_MISSION_ORDER=Your mission is to secure the meat packing facility and prevent the dispersal of the chemical agent. The only thing worse than terrorists are chemical terrorists. These guys should be easy to spot in their chemical suits and will probably be the ones to initiate the chemical bombs. Stay alert. This stuff is bad and nothing can protect you if you fail.
ID_NEWSWIRE=Downtown London was thrown into turmoil today after a robbery at a venerable banking institution turned deadly. What looked to be a simple attempt to break into the bank's safe turned into a hostage situation, with the Metropolitan police arriving in time to prevent the robbers' escape. However, the job of digging the hostage-takers out fell once again to the SAS, who were equal to the task. Several casualties were reported in the affair, including a pair of police officers wounded when the thieves first opened fire.\n\nThe Prime Minister himself offered congratulations to the SAS members and expressed his deep condolences for the families of those killed by the gunmen. Joining the Prime Minister in those sentiments was the Chief Ambassador from Switzerland, Georg Werner, who expressed his country's gratitude for the "speedy and efficient action" of the SAS. \n\nSeveral Swiss banking officials were inside the bank when the robbery started, though none were hurt in the resultant gunplay.
ID_SWEENY=We finally have the full picture, thanks to the documents you rescued in London. They are, to put it mildly, explosive - a collection of banking records dating from the Second World War detailing the systematic looting of assets of Holocaust victims by the Third Reich, their allies in the Ustache regime in Yugoslavia and complicit bankers in Geneva. Names are named, including one Peja Sicic. You might remember him. He's the senior citizen that Venezuela wanted to deport just before the unpleasantness at the refinery. In addition, there are repeated mentions of an attaché to the Ministry of Finance, a man named Dejan Blazevic. We've got a picture of Blazevic and, on a hunch, one of the lads at Intel used some imaging software to make a projection as to what he'd look like now. The end result looks a lot like our Mr. Nikola Gospic.\n\nIt seems Blazevic got himself smuggled out of Europe in 1945. He arrived in the Caymans a few years later, calling himself Gospic. The money he used to set him
ID_SWEENY1=self up with was skimmed from the accounts he had helped liquidate. Intel's best guess is that he felt that the Sicic deportation proceedings might blow his own cover, so he started taking steps to hide his trail. That's not all he's up to, though. The repeated attacks on the Venezuelan oil industry, the chemical weapons, the neo-fascist ties - they add up to something more.\n\nNow, on to more bad news. While Gospic doesn't have a stake in that import-export firm you hit in Brazil, Gutierrez does. And Gutierrez's import-export company does do an awful lot of business with firms that are owned by Mr. Nikola Gospic. In particular, there's some connection with the meat-packing firm in Pilar. We know all of this because of one of the phone calls we listened in on at Gutierrez's place. Gospic called Gutierrez to discuss their plans for that business - plans that included using the VX chemical agents you confiscated in Brazil.
[Island_Dawn]
ID_CLARK=Gospic has gone to ground, which just makes him more dangerous. He's found himself a hole somewhere and we're going to have to dig him out. We start with his mansion on Cayman Brac. It's highly unlikely he's there, but his stash of blistering agent might be. At the very least, Intel wants to go over that place top to bottom. If we're lucky, they'll be able to figure out what he's got left, and where he's going to hit next.\n\nAt this point you should be familiar with the layout of the estate. We don't have any hostages to worry about this time, which is a bonus, but it also means that all resistance isn't going to be bottled up in the main house.
ID_CODENAME=Briar Gate
ID_CONTROL=Operation Briar Gate. RAINBOW is authorized to search the estate of Nikola Gospic for evidence of more chemical weapons. Intel believes he is still in possession of a highly lethal blistering agent, which he will attempt to use. Your mission is to prevent the destruction of evidence on Gospic's computer and to secure the estate using all necessary force.
ID_DATETIME=2006.12.22 - 1710
ID_LOCATION=Cayman Brac
ID_MENUNAME=Island Estate 2
ID_MISSION_ORDER=Your mission is to prevent the destruction of evidence on Gospic's computer and to secure the estate using all necessary force. Resistance should be more organized than the last time you were here, so stay on your toes. Hitting the place from the rear should provide you with an element of surprise.
ID_NEWSWIRE=Tragedy once again struck the city of Pilar, Argentina, as government troops were called in to deal with a terrorist threat to spike meat from one of the city's largest processing plants with poison. "The terrorists were unsuccessful in their efforts, and there should be no risk to the general public," read a terse statement issued by Argentina's Minister of Health, though a spokesman later clarified that the plant would be closed "for the foreseeable future", while teams of scientists made sure there was no enduring contamination. \n\nA government source who spoke on condition of anonymity confirmed that there was "a chemical hazard" on site, but reiterated that steps being taken by the decontamination team were "purely a precaution", as there was no danger to the general public.
ID_SWEENY=We've traced the origin of the VX ingredients you confiscated in Pilar. It's old Soviet manufacture, smuggled out by Preston. We've even managed to pinpoint the buy at which he got it. Unfortunately, it's not all he picked up on his little shopping trip. In addition to the VX, he got the compounds necessary to home-brew more of the stuff and what we are pretty certain is a blistering agent. You nicked the former when you hit the import-export firm in Porto Alegre, but the blistering agent's still out there. So's Gospic, for that matter, and Gutierrez along with him. \n\nThe blistering agent we're looking at is most likely phenyldichloroarsine, a colorless, odorless liquid. It does a number on the eyes, lungs, skin and guts of anyone who's exposed. It's slightly less effective than so-called mustard gas, the grandfather of blistering agents, but that's about the only good thing about it. By the time symptoms of exposure appear, it's already done its work.
[Airport_Night]
ID_CLARK=Bad luck for Interpol this time. They had a man infiltrating Gospic's operation from the other side, and he just called in from Cayman Brac airport with the last pieces of the puzzle. The endgame is set for Rio de Janeiro, at the Festas Juninas. The men the agent was working with were involved in smuggling the chemical agent from the Caymans to Rio, so that Gospic could expose the crowds at the festival. We're talking hundreds of thousands of people minimum.\n\nUnfortunately, back-up didn't reach their man in time, and he was killed. The good news, what there is of it, is that the local police have been on a hair trigger lately. They arrived in time to keep at least some of Gospic's people on the island, and contained them within the airport complex. They also confiscated the luggage these jokers were trying to load onto a private plane. It's aerosol equipment, perfect for dispersing the blistering agent. This helps limit the ones who got away. Get to work.
ID_CODENAME=Talon Steel
ID_CONTROL=Operation Talon Steel. Men identified as working for Gospic have killed an Interpol agent who had infiltrated their operation and seized control of an airport on Cayman Brac. Their baggage, which has been recovered, contains aerosol dispersal equipment intended for use with the blistering agent, the existence of which has been confirmed. Your mission is to secure the airport and neutralize all gunmen.
ID_DATETIME=2006.12.22 - 2330
ID_LOCATION=Cayman Brac
ID_MENUNAME=Private Airport 2
ID_MISSION_ORDER=Your mission is to secure the airport and neutralize all gunmen. It seems that Gospic's men are trying to protect the central hanger, so that should be your main target. Synchronizing a multi-team entry into the hanger should provide you with an element of surprise.
ID_NEWSWIRE=Once again, the island of Cayman Brac was rocked by gunfire, as a combined force of police and British SAS troops raided an estate that local officials claimed was a hub for a narcotics ring. "We have reason to believe," said Cayman Islands government spokesman Joseph McFayden, "that the house has been used as a relay station for the illegal narcotics trade for some time, and the evidence that has been retrieved in the wake of this morning's efforts supports that view." \n\nPolice reportedly seized over a thousand kilos of cocaine in the raid, as well as a small cache of automatic weapons and what authorities believe was equipment for setting up a drug refining operation. \n\nMcFayden refused to answer questions as to whether the house was the one which Cayman police had raided earlier in the year, but independent sources near the police commissioner's office confirmed this was the case.
ID_SWEENY=We have one more tidbit on Gospic himself. On a hunch, I had a look at his medical records. They tell the rest of the man's story. He's got liver cancer, and it's terminal. The initial prognosis was six months. That was two years ago, but he can't keep bucking the odds forever. Looking at his psych profile, I'd say he's a good candidate for a grand suicide gesture, and the blistering agent gives him the perfect tool for the job.\n\nThe real twist, however, is what comes after he's dead. We know now from the records at the meat packing plant that he's been squirreling away money for years to support a new global fascist movement. It would be his little goodbye present to the world, a legacy of hate from the Second World War. As part of that, he was targeting tracts of the Venezuelan oil fields for acquisition, with an eye on sabotaging them so the bottom would fall out of the price. The man's literally worth billions, and as soon as he dies it all goes toward resurrecting the jack-bo
ID_SWEENY1=oted goose-step.
[Garage]
ID_CLARK=Intel has recovered the notebook kept by the Interpol agent who was killed on Cayman Brac. Among other things, it's got the address for a garage in Rio where Gospic's men have been building a parade float. It also has a schedule for where the float's going to be when along the parade route. We don't know where it is now, but we do know where the garage is. Even better, according to the notebook Gutierrez is still scheduled to be there. We can capture one rat, and he'll lead us to the other. \n\nMost of the equipment should be out of the garage already, which means less cover for whatever resistance you do uncover. It also means there's less chance that the blistering agent might get set off accidentally during the shooting. The Brazilian government isn't terribly thrilled with our intervention in this matter, but they owe us one from Porto de Allegre. Besides, if Intel read that notebook right, we've got a matter of hours before everything hits the fan.
ID_CODENAME=Whisper Blade
ID_CONTROL=Operation Whisper Blade. A garage near the Festas Juninas parade route in Rio de Janeiro must be stormed. It has been identified as the site where Gospic constructed the parade float from which he intended to disperse the blistering agent. Intel believes that Alvaro Gutierrez is on site, supervising the last details of the operation. Your mission is to secure the garage and capture Gutierrez.
ID_DATETIME=2007.02.04 - 1100
ID_LOCATION=Rio de Janeiro, Brazil
ID_MENUNAME=Garage
ID_MISSION_ORDER=Your mission is to secure the garage and capture Gutierrez. Make your way through the garage area to the car dealership, but be careful. The place is crawling with Gutierrez's security personnel. Synchronize your assault on the upstairs conference room, where Gutierrez is suspected to be, to maximize your chance of success. Do NOT shoot Gutierrez. We need him alive.
ID_NEWSWIRE=Police and drug smugglers clashed for the second time in days in the Cayman Islands today. SWAT officers were able to round up and arrest fleeing smugglers who were attempting to leave the island in the wake of previous government actions. \n\nGovernor Reginald Tinworth of the Cayman Islands congratulated the officers for their speedy work and vowed that there would be no more disturbances like this in the island paradise.
ID_SWEENY=Right now Rio's in the middle of the Festas Juninas. It's a series of celebrations venerating a handful of saints, and it comes with the usual parade and whatnot. It also brings a lot of people into the city and onto the streets, especially along the parade route. That means there will be crowds in exactly the places we're going to need to look for Gospic.\n\nGospic has sponsored a float in the big parade the last few years. He's entered one again this year. Put two and two together and you confirm what that Interpol agent told us: he's using the float as a way to spread the blistering agent along the entire length of the parade route.
[Parade]
ID_CLARK=Gutierrez ratted out Gospic to save his own skin, which is good news for us. The float's being prepared on a side street near the start of the parade route. It's guarded by everything Gospic has left, which means that hopefully they're keeping civilians away from it. Gospic himself is somewhere in the area. He wants to watch it go down up close and personal, which means that we can nail him.\n\nWe've relayed our findings to the local authorities and the police are already moving people off the streets. They're leaving Gospic to us. Be sure to search the buildings around the float for him and his men.
ID_CODENAME=Steel Rose
ID_CONTROL=Operation Steel Rose. The float concealing the blistering agent has been located near the beginning of the parade route, and must be seized. Gutierrez has surrendered the rough locations of both Gospic and the blistering agent, which he intends to disperse by means of a small concussion device. Your mission is to prevent the detonation of the explosive and eliminate both Gospic and his men.
ID_DATETIME=2007.02.04 - 1800
ID_LOCATION=Rio de Janeiro, Brazil
ID_MENUNAME=Parade Line-up
ID_MISSION_ORDER=Your mission is to prevent the detonation of the explosive and eliminate Gospic. We believe Gospic is on the hotel's roof with some of his men overseeing the final aspects of the operation. However, before getting to him, make sure you diffuse the chemical bomb located on one of the floats. Check your map for the exact location. Some of Gospic's crazier men have orders to activate the bomb as soon as they sense danger, so stay alert. Also watch out for snipers on the roofs and at the windows, because they're watching for you.
ID_NEWSWIRE=A street brawl turned ugly in the streets of Rio de Janeiro this morning when police were called in to break up a fight that had upwards of twenty participants. The men, some of whom were apparently trying to sabotage a float for today's Festas Juninas parade, were taken into custody at a garage where a float had been prepared.\n\nThe festival, a celebration of several saints' holidays, draws hundreds of thousands of tourists to Rio, and police say they're stepping up efforts to make the city safe and peaceful for as long as the party lasts. "People get very enthusiastic about the parade," said Simon Melchor, a local resident who's been working on floats for the parade for over twenty years. "Sometimes you just get a little over-excited."
ID_SWEENY=With the loss of his aerosol equipment, Gospic has been forced to fall back on a cruder distribution method. According to Gutierrez, he's planted an explosive charge right in the middle of the float, with the blistering agent bundled around it. In the middle of the parade, Gospic's boys are going to abandon the float and the device will blow. It's a tricky balance, but if he's figured the forces right, the detonation could spread the chemical agent over half the city. If he hasn't, the blast will probably just kill everyone for a couple of blocks. It's a lose-lose situation.\n\nUltimately, Intel believes that this isn't about Rio in particular. It's about the impact an event like this will have across all of South America. The projections that have been run are not pretty. Even the most optimistic leave the door wide open for Gospic - or, more accurately, his heirs - to swoop in on those oil fields and make a killing. Now that we know what's going on, steps can be taken to prevent that, but t
ID_SWEENY1=he first order of business is still stopping Gospic.
[Peaks]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Ice Dagger
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.03.01 - 1500
ID_LOCATION=Laurentians, Canada
ID_MENUNAME=(MP) Peaks
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[Warehouse]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Boxed Goods
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.06.24 - 2300
ID_LOCATION=Bergen, Norway
ID_MENUNAME=(MP) Warehouse
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[Presidio]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Old Guard
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.04.15 - 1100
ID_LOCATION=San Francisco, USA
ID_MENUNAME=(MP) Presidio
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[Prison]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Shackled Time
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.07.15 - 2300
ID_LOCATION=Limoges, France
ID_MENUNAME=(MP) Prison
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[Streets]
ID_CLARK=Multiplayer Map.
ID_CODENAME=City Street Large
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.08.14 - 0030
ID_LOCATION=Hereford, England
ID_MENUNAME=(MP) Streets
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[Training]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Live Fire
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2007.08.02 - 0800
ID_LOCATION=Hereford, England
ID_MENUNAME=(MP) Training
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
[TrainingSP]
ID_CLARK=Multiplayer Map.
ID_CODENAME=Training
ID_CONTROL=Multiplayer Map.
ID_DATETIME=2005.10.29 - 1400
ID_LOCATION=Hereford, England
ID_MENUNAME=Training
ID_MISSION_ORDER=Multiplayer Map.
ID_NEWSWIRE=Multiplayer Map.
ID_SWEENY=Multiplayer Map.
